In [1]:
import pandas as pd
filepath='Datafiles/income.csv'
def readcsvdata(filepath):
    return pd.read_csv(filepath)
income=readcsvdata(filepath)
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [2]:
def getRowIndex(df, rowkey):
    rowindex=0
    for i in range(len(df.values)):
        if df.values[i][0] == rowkey or df.values[i][1] == rowkey:
            rowindex = i
    return rowindex

def getColumnIndex(df, columnkey):
    columnindex=0
    for i in range(len(df.columns)):
        if df.columns[i] == columnkey:
            columnindex = i
    return columnindex

def valueFromRowColumn(df, rowkey, columnkey):
    rowindex = getRowIndex(df, rowkey)
    columnindex = getColumnIndex(df, columnkey)
    return df.values[rowindex][columnindex]
getRowIndex(income, "California")

4

In [3]:
#Function to Caluclate avarage income of all states in 2005 to 2013
def avarageofallstates(df,start,end):
    s=getColumnIndex(df, start)
    e=getColumnIndex(df,end)
    for i in df.values:
        k=sum(i[s:e+1])//len(i[s:e+1])
        print(k)
    
avarageofallstates(income,"2005","2013")

41126
60106
47214
38828
55350

In [4]:
#Function to Caluclate avarage income of all states in last three years
def avarageallstatesinthree(df):
    li=[]
    for i in df.values:
        li.append(sum(i[-3:]//len(i[-3:])))
    print(max(li))
    print(df.values[li.index(max(li))][1])
avarageallstatesinthree(income)
getColumnIndex(income, "California")

60738
Alaska

0

In [5]:
def avarageallstatesinthree(df,start,end):
    s=getColumnIndex(df,start)
    e=getColumnIndex(df,end)
    li=[]
    for i in df.values:
        k=sum(i[s+1:e+1])/(e-s+1)
        li.append(k)
    print(li)
    print(df.values[li.index(min(li))][1])
avarageallstatesinthree(income,"2007","2010")

[31347.25, 45860.25, 34887.25, 28677.75, 41857.75]
Arkansas

In [6]:
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [7]:
sum(income.values[4][2:])
getRowIndex(income, "42212")

0

In [8]:
#Function to print the list of all states in the same line with avarage income less than california
def lessthanCali(df):
    it=getRowIndex(income, "California")
    cali=sum(income.values[it][2:])//len(income.values[it][2:])
    li=[]
    st=[]
    for i in range(it):
        k=sum(df.values[i][2:])//len(df.values[i][2:])
        if k<cali:
            li.append(k)
            st.append(df.values[i][1])
    print(li)
    print(*st)
            
lessthanCali(income)

[41126, 47214, 38828]
Alabama Arizona Arkansas

In [9]:
for i in range(5):
        k=sum(income.values[i][2:])
        print(k)

370138
540959
424933
349460
498154

In [10]:
for i in income.values:
    print(i)

['04000US01' 'Alabama' 37150 37952 42212 44476 39980 40933 42590 43464
 41381]
['04000US02' 'Alaska' 55891 56418 62993 63989 61604 57848 57431 63648
 61137]
['04000US04' 'Arizona' 45245 46657 47215 46914 45739 46896 48621 47044
 50602]
['04000US05' 'Arkansas' 36658 37057 40795 39586 36538 38587 41302 39018
 39919]
['04000US06' 'California' 51755 55319 55734 57014 56134 54283 53367 57020
 57528]

In [11]:
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [12]:
#Function to printall states in decreasing order in 2009
def decrease2019(df,year):
    c=getColumnIndex(income,year)
    s=[]
    n=[]
    for i in df.values:
        n.append(i[1])
        s.append(i[6])
    k=sorted(s,reverse=True)
    for i in range(len(k)):
        print(n[s.index(k[i])],":",k[i])
        #for j in range(len(k)):
         #   if k[i]==s[j]:
          #      print(n[j],":",s[j])
decrease2019(income,"2009")

Alaska : 61604
California : 56134
Arizona : 45739
Alabama : 39980
Arkansas : 36538

In [13]:
l=[1,2,3,4,6,7]
k=sorted(l)
k[::-1]

[7, 6, 4, 3, 2, 1]

In [14]:
#Function lowest record income from 2005 to 2013
def lowestrecord(df,start,end):
    s=[]
    l=[]
    for i in df.values:
        s.append(i[1])
        l.append(min(i[2:9]))
    print(s,l)
    print(s[l.index(min(l))])
lowestrecord(income,"2005","2013")

['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California'] [37150, 55891, 45245, 36538, 51755]
Arkansas

['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California'] [44476, 63989, 48621, 41302, 57014]
Arkansas